config.org
#+title: GNU Emacs configuration
#+author: Srijan Choudhary
#+email: srijan4@gmail.com
#+language: en
#+options: ':t toc:nil num:t author:t email:t
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*Last revised and exported on {{{latest-export-date}}} with a word
count of {{{word-count}}}.*

This is my literate Emacs configuration file.

I use minimal-emacs.d as the baseline for my config. It provides two main files:
- early-init.el
- init.el

Apart from these, it allows me to insert configuration as required into the following files:
- pre-early-init.el
- post-early-init.el
- pre-init.el
- post-init.el


When I want to modify my Emacs setup, I edit this file and then
evaluate the following code block or do =C-c C-v C-t=. All files will
be updated accordingly.

#+begin_src emacs-lisp :tangle no :results none
  (org-babel-tangle)
#+end_src

* pre-early-init

This file has the config that has to be loaded before the rest of the minimal-emacs.d code is run

#+begin_src emacs-lisp :tangle "pre-early-init.el"
  ;;; pre-early-init.el --- -*- no-byte-compile: t; lexical-binding: t; -*-

  (setq minimal-emacs-ui-features '(context-menu menu-bar dialogs tooltips))

  ;; Reducing clutter in ~/.emacs.d by redirecting files to ~/emacs.d/var/
  (setq minimal-emacs-var-dir (expand-file-name "var/" minimal-emacs-user-directory))
  (setq package-user-dir (expand-file-name "elpa" minimal-emacs-var-dir))
  (setq user-emacs-directory minimal-emacs-var-dir)

  ;; By default, minimal-emacs-package-initialize-and-refresh is set to t, which
  ;; makes minimal-emacs.d call the built-in package manager. Since Elpaca will
  ;; replace the package manager, there is no need to call it.
  (setq minimal-emacs-package-initialize-and-refresh nil)

  (defun display-startup-time ()
    "Display the startup time and number of garbage collections."
    (message "Emacs init loaded in %.2f seconds (Full emacs-startup: %.2fs) with %d garbage collections."
             (float-time (time-subtract after-init-time before-init-time))
             (time-to-seconds (time-since before-init-time))
             gcs-done))

  (add-hook 'emacs-startup-hook #'display-startup-time 100)
#+end_src

* post-early-init

#+begin_src emacs-lisp :tangle "post-early-init.el"
  ;;; post-early-init.el --- -*- no-byte-compile: t; lexical-binding: t; -*-
  (when (not (null (getenv "ANDROID_ROOT")))
    (setenv "PATH" (format "%s:%s" "/data/data/com.termux/files/usr/bin"
                           (getenv "PATH")))
    (push "/data/data/com.termux/files/usr/bin" exec-path))
#+end_src

* pre-init

#+begin_src emacs-lisp :tangle "pre-init.el"
  ;;; pre-init.el --- -*- no-byte-compile: t; lexical-binding: t; -*-
#+end_src

*** Elpaca

#+begin_src emacs-lisp :tangle "pre-init.el"
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Optional: Install use-package support
  (elpaca elpaca-use-package
    (elpaca-use-package-mode))

  (setopt use-package-compute-statistics t)
  (setopt use-package-always-defer t)

  ;; Lock file
  ;; (setq elpaca-lock-file (expand-file-name "elpaca-lock.eld" minimal-emacs-user-directory))
#+end_src

* post-init

** Header
This will generate a header at the top of the tangled file to indicate it is generated and is not meant to be modified directly.

#+begin_src emacs-lisp :tangle "post-init.el" :epilogue (format-time-string ";; Last generated on %c")
  ;;; post-init.el --- -*- no-byte-compile: t; lexical-binding: t; -*-
  ;; This file has been generated from config.org file. DO NOT EDIT.
#+end_src
** System information
#+begin_src emacs-lisp :tangle "post-init.el"
  (defvar my-linux-p (equal (system-name) "GGN001944"))
  (defvar my-windows-p (equal (system-name) "SHADOW"))
  (defvar my-mac-p (equal (system-name) "USA600098.local"))
  (defvar my-phone-p (not (null (getenv "ANDROID_ROOT")))
    "If non-nil, GNU Emacs is running on Termux.")
  (when my-phone-p (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3"))
  (server-start)
#+end_src
** COMMENT Compile Angel
Speed up Emacs by Automatically Byte-compiling and Native-compiling all .el files

TODO: Need to evaluate how much speedup this gives

#+begin_src emacs-lisp :tangle "post-init.el"
  (use-package compile-angel
    :ensure t
    :demand t
    :custom
    ;; Set `compile-angel-verbose` to nil to suppress output from compile-angel.
    ;; Drawback: The minibuffer will not display compile-angel's actions.
    (compile-angel-verbose t)

    :config
    ;; The following directive prevents compile-angel from compiling your init
    ;; files. If you choose to remove this push to `compile-angel-excluded-files'
    ;; and compile your pre/post-init files, ensure you understand the
    ;; implications and thoroughly test your code. For example, if you're using
    ;; `use-package', you'll need to explicitly add `(require 'use-package)` at
    ;; the top of your init file.
    (push "/pre-init.el" compile-angel-excluded-files)
    (push "/post-init.el" compile-angel-excluded-files)
    (push "/pre-early-init.el" compile-angel-excluded-files)
    (push "/post-early-init.el" compile-angel-excluded-files)
    (push "/org-clock-save.el" compile-angel-excluded-files)

    ;; A local mode that compiles .el files whenever the user saves them.
    ;; (add-hook 'emacs-lisp-mode-hook #'compile-angel-on-save-local-mode)

    ;; A global mode that compiles .el files before they are loaded.
    (compile-angel-on-load-mode))
#+end_src
** Personal Information

#+begin_src emacs-lisp :tangle "post-init.el"
  (setq user-full-name "Srijan Choudhary"
        user-mail-address "srijan4@gmail.com")
#+END_SRC
** Mac Specific
#+begin_src emacs-lisp :tangle "post-init.el"
  (when my-mac-p
    (setq insert-directory-program "/opt/homebrew/bin/gls")

    (use-package exec-path-from-shell
      :ensure t
      :demand t
      :config
      (add-to-list 'exec-path-from-shell-variables "ANTHROPIC_API_KEY")
      (exec-path-from-shell-initialize))
    )
#+end_src
** Misc config

#+begin_src emacs-lisp :tangle "post-init.el"

  (defun my-reload-emacs-configuration ()
    (interactive)
    (load-file (expand-file-name "init.el" minimal-emacs-user-directory)))

  ;; Open the config file
  (global-set-key (kbd "C-x ,") (lambda() (interactive) (find-file (expand-file-name "config.org" minimal-emacs-user-directory))))

  ;; Custom file
  (setq custom-file null-device)

  ;; Auto-revert in Emacs is a feature that automatically updates the
  ;; contents of a buffer to reflect changes made to the underlying file
  ;; on disk.
  (add-hook 'after-init-hook #'global-auto-revert-mode)

  ;; recentf is an Emacs package that maintains a list of recently
  ;; accessed files, making it easier to reopen files you have worked on
  ;; recently.
  (add-hook 'after-init-hook #'(lambda()
                                 (let ((inhibit-message t))
                                   (recentf-mode 1))))
  (add-hook 'kill-emacs-hook #'recentf-cleanup)

  ;; savehist is an Emacs feature that preserves the minibuffer history between
  ;; sessions. It saves the history of inputs in the minibuffer, such as commands,
  ;; search strings, and other prompts, to a file. This allows users to retain
  ;; their minibuffer history across Emacs restarts.
  (add-hook 'after-init-hook #'savehist-mode)

  ;; save-place-mode enables Emacs to remember the last location within a file
  ;; upon reopening. This feature is particularly beneficial for resuming work at
  ;; the precise point where you previously left off.
  (add-hook 'after-init-hook #'save-place-mode)

  ;; Enable `auto-save-mode' to prevent data loss. Use `recover-file' or
  ;; `recover-session' to restore unsaved changes.
  (setq auto-save-default t)
  (setq auto-save-interval 300)
  (setq auto-save-timeout 30)

  ;; Hide warnings and display only errors
  (setq warning-minimum-level :error)

  ;; Disable momentum-based scrolling for precise control and enable smoother scrolling.
  (setq pixel-scroll-precision-use-momentum 1)
  (pixel-scroll-precision-mode 1)

  ;; Pixel Scroll Precision Mode on Emacs for macOS: If you're using a pre-built
  ;; emacs-mac (version <= 29.1), smooth scrolling is handled by the Mac port
  ;; code, which overrides `pixel-scroll-precision-mode'. In this case, use the
  ;; following line instead of enabling `pixel-scroll-precision-mode':
  ;;
  ;; (pixel-scroll-mode t)
  ;;
  ;; For more details, see:
  ;; https://bitbucket.org/mituharu/emacs-mac/commits/65c6c96f27afa446df6f9d8eff63f9cc012cc738

  ;; Display the time in the modeline
  (display-time-mode 1)

  ;; Paren match highlighting
  (show-paren-mode 1)

  ;; Replace selected text with typed text
  (delete-selection-mode 1)

  ;; Configure Emacs to ask for confirmation before exiting
  ;; (setq confirm-kill-emacs 'y-or-n-p)

  ;; Automatically hide file details (permissions, size, modification date, etc.)
  ;; in Dired buffers for a cleaner display.
  (add-hook 'dired-mode-hook #'dired-hide-details-mode)

  ;; Kill current buffer (instead of asking first buffer name)
  (global-set-key (kbd "C-x k") 'kill-current-buffer)

  ;; M-n for new frame (M-n is unbound in vanilla emacs)
  (defun new-frame ()
    (interactive)
    (select-frame (make-frame))
    (switch-to-buffer "*scratch*"))
  (global-set-key (kbd "M-n") 'new-frame)

  (setq save-interprogram-paste-before-kill t)

  (global-visual-line-mode 1)

#+end_src
** Which-Key
#+begin_src emacs-lisp :tangle "post-init.el"

  (use-package which-key
    :ensure nil ; builtin
    :defer t
    :commands which-key-mode
    :hook (after-init . which-key-mode)
    :custom
    (which-key-idle-delay 1.5)
    (which-key-idle-secondary-delay 0.25)
    (which-key-add-column-padding 1)
    (which-key-max-description-length 40))

  (use-package uniquify
    :ensure nil
    :custom
    (uniquify-buffer-name-style 'reverse)
    (uniquify-separator "•")
    (uniquify-after-kill-buffer-p t)
    (uniquify-ignore-buffers-re "^\\*"))

#+end_src
** Looks & Themes
*** Non-Android
#+begin_src emacs-lisp :tangle "post-init.el"
  (when (not my-phone-p)
    ;; (add-to-list 'default-frame-alist '(height . 55))
    ;; (add-to-list 'default-frame-alist '(width . 160))
    (scroll-bar-mode 1)
    )
#+end_src
*** Mac
#+begin_src emacs-lisp :tangle "post-init.el"
  (when my-mac-p
    (defun my/mac-apply-theme (appearance)
      "Load theme, taking current system APPEARANCE into consideration."
      (mapc #'disable-theme custom-enabled-themes)
      ;; (set-frame-font "Aporetic Sans Mono-15" nil t)
      (set-face-font 'default "IBM Plex Mono-15")
      ;; (set-face-font 'variable-pitch "Inter-15")
      (pcase appearance
        ('light (load-theme 'modus-operandi-tinted t))
        ('dark (load-theme 'modus-vivendi-tinted t))))
    (add-hook 'ns-system-appearance-change-functions #'my/mac-apply-theme)

    (setopt ns-use-srgb-colorspace nil)
    (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
    ;; (add-to-list 'default-frame-alist '(ns-appearance . dark))

    ;; (use-package calle24 :demand t)
    )
#+end_src
*** Linux
#+begin_src emacs-lisp :tangle "post-init.el"
  (when my-linux-p
    (set-frame-font "Aporetic Sans Mono-13" nil t)
    (add-to-list 'default-frame-alist '(font . "Aporetic Sans Mono-13"))
    (load-theme 'modus-vivendi-tinted t)
    )
#+end_src
*** Phone
#+begin_src emacs-lisp :tangle "post-init.el"
  (when my-phone-p
    (load-theme 'modus-operandi-tinted t)
    (set-frame-font "Aporetic Sans Mono-17" nil t)
    (add-to-list 'default-frame-alist '(font . "Aporetic Sans Mono-17"))
    (tool-bar-mode 1)
    ;; (modifier-bar-mode 1)
    (setopt tool-bar-position 'top)
    (setopt tool-bar-button-margin 20)
    (setopt touch-screen-display-keyboard t)
    (setopt touch-screen-precision-scroll t)
    (setopt pixel-scroll-precision-use-momentum t)
    (use-package touchpad
      :ensure (:host github :repo ("awu7/touchpad-scroll-mode" . "touchpad")
                     :main "touchpad.el")
      :init
      (load "touchpad")
      (touchpad-scroll-mode)
      (setq touchpad-pixel-scroll t))
    )
#+end_src
